classwork/W7/D5/reddit_clone/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "9MZxkdZT42IFoHjK-wQubw"], ["updated_at", "2022-06-03 17:05:12.528810"], ["id", 2]]