classwork/W6/D4/artwork_api pt 2/app/controllers/artwork_shares_controller.rb

  def create
    artworkshare = ArtworkShare.new(artwork_share_params)
    if artworkshare.save!
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 2], ["artwork_id", 3], ["created_at", "2022-05-26 21:21:05.799830"], ["updated_at", "2022-05-26 21:21:05.799830"]]

  def destroy
    @artworkshare = ArtworkShare.find(params[:id])
    if @artworkshare
      render json: @artworkshare
      @artworkshare.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]