classwork/W6/D4/artwork_api pt 2/app/controllers/artworks_controller.rb

    def show
      @artworks = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def index
      if params.has_key?(:user_id)
        #@articles = Artwork.joins(:viewing_users).where(user_id: params[:id])
        @articles = Artwork.left_outer_joins(:shared_viewers).where("artist_id = #{params[:user_id]} OR viewer_id = #{params[:user_id]}")
      else
        # index of top-level resource
        @articles = Artwork.all
---
SELECT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" LEFT OUTER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE (artist_id = :user_id OR viewer_id = :user_id)
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
      @artworks = Artwork.find(params[:id])
      if @artworks.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 5], ["updated_at", "2022-05-26 18:56:13.650844"], ["id", 2]]