classwork/W6/D4/artwork_api pt 2/app/controllers/comments_controller.rb

  def index
    if params.has_key?(:user_id)
      @comments = Comment.where(user_id: params[:user_id])
    elsif params.has_key?(:artwork_id)
      @comments = Comment.where(artwork_id: params[:artwork_id])
    else
      @comments = Comment.all
---
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 5]]