classwork/W7/D5/reddit_clone/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users"."username" FROM "users" WHERE (id = 1)
SELECT "subs"."title" FROM "subs" WHERE (id = 1)
---
  def show
    @post = Post.find_by(id: params[:id])
    @user = User.where("id = #{@post.user_id}").pluck(:username)
    @sub = Sub.where("id = #{@post.sub_id}").pluck(:title)

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(valid_params)
    if @post.save