classwork/W7/D5/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT * FROM "posts" WHERE (sub_id = 3)
---
  def show
    @sub = Sub.find_by(id: params[:id])
    @posts = Post.select("*").where("sub_id = #{@sub.id}")

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "app"], ["description", "app academy has fun"], ["moderator_id", 5], ["created_at", "2022-06-03 19:21:55.211326"], ["updated_at", "2022-06-03 19:21:55.211326"]]
---
  def create
    @sub = Sub.new(valid_params)
    if @sub.save!

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "this is a new edit"], ["updated_at", "2022-06-03 20:52:10.878400"], ["id", 2]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update(valid_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def check_owner
    @sub = Sub.find_by(id: params[:id])