classwork/W7/D3/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "VnyuJA7qXz-LF2Z1QrGGTg"], ["LIMIT", 1]]
---
  def current_user
    st = session[:session_token]
    @current_user ||= User.find_by(session_token: st)