classwork/W7/D3/music_app/app/controllers/bands_controller.rb

  def create
    band = Band.new(valid_params)
    if band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Deez bands"], ["created_at", "2022-06-02 00:04:05.419799"], ["updated_at", "2022-06-02 00:04:05.419799"]]

  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(valid_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "bee killers"], ["updated_at", "2022-06-02 00:10:22.393470"], ["id", 3]]

  def destroy
    @band = Band.find_by(id: params[:id])
    @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]