classwork/W6/D3/artwork_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @chirp = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dog"], ["email", "dog@gmail.com"], ["created_at", "2022-05-25 22:37:44.508343"], ["updated_at", "2022-05-25 22:37:44.508343"]]
---
  def create
    user = User.new(params.require(:user).permit(:name, :email))
  # replace the `user_attributes_here` with the actual attribute keys

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @chirp = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "bo"], ["updated_at", "2022-05-25 23:31:35.742707"], ["id", 2]]
---
  def update

      @chirp = User.find(params[:id])
      if @chirp.update(banana_params)